Tekla Open API Reference for Tekla Structures 2025
Operation.Ungrouping Method (RebarGroup)
 Ungroups the rebar group and creates new single rebars.
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static ModelObjectEnumerator Ungrouping(
	RebarGroup Reinforcement
)
Public Shared Function Ungrouping (
	Reinforcement As RebarGroup
) As ModelObjectEnumerator
Parameters
Reinforcement
Type: Tekla.Structures.Model.RebarGroup
The rebar group to be ungrouped.
Return Value
Type: ModelObjectEnumerator
An enumerator of single rebars.
See Also
Reference
Operation Class
Ungrouping Overload
Tekla.Structures.Model.Operations Namespace